Repository: NandayDev/mvvm-flutter-poc
Catalog: lib/l10n/app_*.arb
Languages: it

source: Error
it: Errore

# loginError
source: Failed login. Please try again
it: Login fallito. Riprova.

# loginSuccessful
source: Login was successful!
it: Login effettuato!

source: Error while fetching quote of the day
it: Errore nel tentativo di scaricare la citazione del giorno

# journalEntryAddPageTitle
source: Add journal entry
it: Aggiungi nota

# journalEntryAddTitleHint
source: Enter the title
it: Digita il titolo

# journalEntryAddContentHint
source: Enter the content
it: Digita il contenuto

# journalEntryIncorrectValuesDialogTitle
source: Incorrect values
it: Valori errati

# journalEntryIncorrectValuesDialogContent
source: Please insert a valid title and content for the journal entry
it: Inserisci valori corretti per la nota

# saveJournalEntry
source: Save
it: Salva

# journalEntrySaveErrorDialogContent
source: Journal entry couldn't be saved. Please try again.
it: Impossibile salvare la nota. Riprova.
